In [1]:
import pandas as pd

In [2]:
df1 = pd.read_excel(r"C:\Users\pa173\Documents\SQL Excel Extracts\Weekly Producer\January\Jan 15 - Jan 21 2023.xlsx", sheet='Export Worksheet', index=False)

In [3]:
df1.dtypes

SUB_BUSINESS_UNIT_NUMBER     int64
MIPS_FUNCTION               object
COUNT(*)                     int64
dtype: object

In [4]:
df1 = df1.rename(columns={'SUB_BUSINESS_UNIT_NUMBER': 'BUSINESS_UNIT_NUMBER'})

In [5]:
df2 = pd.read_excel(r"C:\Users\pa173\Documents\Communications\All Producer with Parent Rollup.xlsx", index=False)

In [6]:
df2.dtypes

BUSINESS_UNIT_NUMBER        int64
PRODUCER                   object
PARENT_NO                   int64
Unnamed: 3                float64
Parent Name                object
PARENT_NO.1                object
Unnamed: 6                float64
Grandparent #             float64
Grandparent Name           object
Unnamed: 9                float64
Great Grandparent #       float64
Great Grandparent Name     object
dtype: object

testing different merges

This merge works

In [7]:
df3 = pd.merge(df1, df2, on='BUSINESS_UNIT_NUMBER', how='right')
#df3.shape

In [8]:
#df3 = pd.merge(left=df1, right = df2, left_on='SUB_BUSINESS_UNIT_NUMBER', right_on='BUSINESS_UNIT_NUMBER')
#df3.shape

In [9]:
df3.head()

,BUSINESS_UNIT_NUMBER,MIPS_FUNCTION,COUNT(*),PRODUCER,PARENT_NO,Unnamed: 3,Parent Name,PARENT_NO.1,Unnamed: 6,Grandparent #,Grandparent Name,Unnamed: 9,Great Grandparent #,Great Grandparent Name
0,100028,FQ,47.0,CHRIS D AGUIRRE #2,91352,NaN,CHRIS D AGUIRRE,91352,NaN,91352.0,CHRIS D AGUIRRE,NaN,91352.0,CHRIS D AGUIRRE
1,100201,FQ,1.0,ADVANCED INSURANCE INC,100201,NaN,ADVANCED INSURANCE INC,100201,NaN,100201.0,ADVANCED INSURANCE INC,NaN,100201.0,ADVANCED INSURANCE INC
2,100214,FQ,26.0,MOHAMED A KAMIL,100214,NaN,MOHAMED A KAMIL,100214,NaN,100214.0,MOHAMED A KAMIL,NaN,100214.0,MOHAMED A KAMIL
3,100273,FQ,9.0,JORDAN SALEH STATE FARM INS,100273,NaN,JORDAN SALEH STATE FARM INS,100273,NaN,100273.0,JORDAN SALEH STATE FARM INS,NaN,100273.0,JORDAN SALEH STATE FARM INS
4,100279,FQ,13.0,MIDTOWN INSURANCE GROUP LLC,100279,NaN,MIDTOWN INSURANCE GROUP LLC,100279,NaN,100279.0,MIDTOWN INSURANCE GROUP LLC,NaN,100279.0,MIDTOWN INSURANCE GROUP LLC

In [10]:
df3.shape

(99235, 14)

this pivot works

In [11]:
#pivot = df3.pivot_table(index=['Parent Name'], values=['COUNT(*)'], aggfunc='sum').sort_values(by=['COUNT(*)'], ascending=False) # don't need this one
df3 = df3.pivot_table(index=['Parent Name'], values=['COUNT(*)'], aggfunc='sum').sort_values(by=['COUNT(*)'], ascending=False)

don't need this one

In [ ]:
#pivot = df3.pivot_table(index=['Parent Name'], values=['COUNT(*)'], aggfunc='sum').sort_values(by=['COUNT(*)'], ascending=False) # don't need this one

In [13]:
#df3.to_excel(r"C:\Users\pa173\Documents\Python\Weekly Report\pivot test.xlsx", index=False)

In [14]:
df3['COUNT(*)'].max()

469.0

In [15]:
df3.sort_values(by=['COUNT(*)'], ascending=False).head()

                              COUNT(*)
Parent Name
ROADWAY INSURANCE INC #1         469.0
EZ INSURANCE GROUP LLC           361.0
JAMES BROWN INS AGENCY INC       297.0
PINNING INS AGENCY INC #1        231.0
RAMIREZ INSURANCE AGENCY INC     172.0

In [16]:
#df3.to_excel(r"C:\Users\pa173\Documents\Python\Weekly Report\df3.xlsx", index=False)

In [17]:
rank_incl = pd.read_excel(r"C:\Users\pa173\Documents\Communications\Wkly Working - Rank and List.xlsx", index=False)
rank_incl.head()

                         Producer  Rank Incl   GGP BUN  Unnamed: 4
0      A & A INSURANCE CENTER LLC   124    Y   92319.0     92319.0
1   A & E 1ST CHOICE INS AGCY LLC    64    Y   93446.0         NaN
2     A & W INSURANCE SERVICE INC   454    Y    1896.0         NaN
3         A DIAMOND INSURANCE LLC   568    Y  101385.0         NaN
4  A F SZABO INSURANCE AGENCY INC   796    Y   65004.0         NaN

In [18]:
rank_incl.shape

(1012, 5)

this merge is important

In [19]:
df4 = pd.merge(left = df3, right = rank_incl, left_on='Parent Name', right_on='Producer')
df4.head()

   COUNT(*)                      Producer  Rank Incl  GGP BUN  Unnamed: 4
0     469.0      ROADWAY INSURANCE INC #1     1    Y  52360.0         NaN
1     361.0        EZ INSURANCE GROUP LLC     2    Y  94565.0         NaN
2     297.0    JAMES BROWN INS AGENCY INC     5    Y  67365.0         NaN
3     231.0     PINNING INS AGENCY INC #1     4    Y   4352.0         NaN
4     172.0  RAMIREZ INSURANCE AGENCY INC     6    Y  68223.0         NaN

In [20]:
df4.shape

(950, 6)

In [21]:
df4 = df4.drop(columns=['GGP BUN', 'Unnamed: 4'])

In [22]:
df4.sort_values(by=['COUNT(*)'], ascending=False).head()

   COUNT(*)                      Producer  Rank Incl
0     469.0      ROADWAY INSURANCE INC #1     1    Y
1     361.0        EZ INSURANCE GROUP LLC     2    Y
2     297.0    JAMES BROWN INS AGENCY INC     5    Y
3     231.0     PINNING INS AGENCY INC #1     4    Y
4     172.0  RAMIREZ INSURANCE AGENCY INC     6    Y

In [23]:
df5 = pd.read_excel(r"C:\Users\pa173\Documents\Communications\Weekly NB and RW Apps and FQ.xlsx", sheet_name='By Producer Weekly Counts', index=False, skiprows= 9)
df5 = df5.drop(index=0)
df5.head()

,Unnamed: 0,Weekly counts by Week,Change Quotes,Change NB Apps,Change RW Apps,Quotes,NB Apps,RW Apps,Quotes.1,NB Apps.1,...,Unnamed: 312,Unnamed: 313,Unnamed: 314,Unnamed: 315,Unnamed: 316,Unnamed: 317,Unnamed: 318,Unnamed: 319,Unnamed: 320,Unnamed: 321
1,1.0,ROADWAY INSURANCE INC #1,-46.0,-8.0,6.0,469,60,48,515,68,...,49,54,49,19,31,39,27,54,55,51
2,2.0,EZ INSURANCE GROUP LLC,-47.0,0.0,-1.0,361,36,17,408,36,...,24,18,31,8,17,17,18,18,21,28
3,3.0,KEYSTONE INSURANCE AGENCY INC,-6.0,4.0,6.0,75,24,15,81,20,...,12,21,21,12,15,18,15,13,20,28
4,4.0,PINNING INS AGENCY INC #1,18.0,0.0,-6.0,231,27,5,213,27,...,15,18,7,12,13,13,6,17,22,17
5,5.0,JAMES BROWN INS AGENCY INC,74.0,-2.0,3.0,297,27,11,223,29,...,12,13,15,12,15,14,12,8,11,13

too many columns, let's remove some old ones

In [24]:
df5 = df5.iloc[:, 1:10]
df5= df5.rename(columns = {'Weekly counts by Week': 'Producer'})
df5.head()

,Producer,Change Quotes,Change NB Apps,Change RW Apps,Quotes,NB Apps,RW Apps,Quotes.1,NB Apps.1
1,ROADWAY INSURANCE INC #1,-46.0,-8.0,6.0,469,60,48,515,68
2,EZ INSURANCE GROUP LLC,-47.0,0.0,-1.0,361,36,17,408,36
3,KEYSTONE INSURANCE AGENCY INC,-6.0,4.0,6.0,75,24,15,81,20
4,PINNING INS AGENCY INC #1,18.0,0.0,-6.0,231,27,5,213,27
5,JAMES BROWN INS AGENCY INC,74.0,-2.0,3.0,297,27,11,223,29

Checking if both columns match

In [25]:
true_count = (df4['Producer'].isin(df5['Producer'])).sum()
false_count = (df4['Producer'].isin(df5['Producer'])==False).sum()
print("Number of true values:", true_count)
print("Number of false values:", false_count)

Number of true values: 950
Number of false values: 0

make a new dataframe for report

In [26]:
df6 = pd.merge(left = df5, right = df4, left_on='Producer', right_on='Producer')
df6.head()

,Producer,Change Quotes,Change NB Apps,Change RW Apps,Quotes,NB Apps,RW Apps,Quotes.1,NB Apps.1,COUNT(*),Rank,Incl
0,ROADWAY INSURANCE INC #1,-46.0,-8.0,6.0,469,60,48,515,68,469.0,1,Y
1,EZ INSURANCE GROUP LLC,-47.0,0.0,-1.0,361,36,17,408,36,361.0,2,Y
2,KEYSTONE INSURANCE AGENCY INC,-6.0,4.0,6.0,75,24,15,81,20,75.0,3,Y
3,PINNING INS AGENCY INC #1,18.0,0.0,-6.0,231,27,5,213,27,231.0,4,Y
4,JAMES BROWN INS AGENCY INC,74.0,-2.0,3.0,297,27,11,223,29,297.0,5,Y

count is still good

In [31]:
df6['COUNT(*)'].sort_values(ascending=False).head()

0    469.0
1    361.0
4    297.0
3    231.0
5    172.0
Name: COUNT(*), dtype: float64

starting report

In [28]:
#df6.to_excel(r"C:\Users\pa173\Documents\Python\Weekly Report\df6.xlsx", index=False)